% Пороскун Олени ПМ-81
% Homework 2
% 5. Fun with find.

mas = input('Введіть вектор або масив елементів:');
dis = input('Введіть скалярну величину, яку ви хочете знайти:');
ind = findNearest(mas, dis)

function ind = findNearest(x, desiredVal) 
x
X = x(:)                       
a = abs (desiredVal - x);     % знаходимо відстань між шуканим елеметом та всіма елементами матриці
y = a(:);                     % робимо з цієї матриці стовпець для пошуку індекса 
minimal = min (y);            % визначаємо найближче до шуканого елемента число або числа 
ind = find(a == minimal);     % знаходимо його(їх) індекс(и)  
% x(ind)                      % перевірка по індексу знайденого елемента
end