/* Пороскун О. ПМ-81   Практична робота 3  БД*/

/* Завдання 1 
1. Створіть запит, якій поверне для всіх співробітників ім’я та розмір його відрахувань у пенсійний фонд.
Розмір відрахувань складає 6% від заробітної плати. Назвіть стовпець з відрахуванням deduction.
*/

-- select ename, sal      --  просто имя и зарплата 
-- from emp;

select ename,             -- відрахування в пенс. фонд у розм. 6% від зарплати
(sal/100)*6 as "deduction"
from emp;

/* Завдання 2 
2. * Бухгалтерії потрібен звіт, якій містить номер співробітника, 
його зарплату  і зарплату збільшену на 20 % (назвіть цю колонку New Salary),
 стовпець Increase, у якому відображається на скільки збільшилася зарплата.
*/
select empno, sal, 
sal + (sal/100)*20 as "New Salary",  -- нова зарплата збільшена на 20%
(sal/100)*20  as "Increase"          -- сума підвищення
from emp;

/* Завдання 3 */
/*3. Обчисліть вираз: (5+5)*20-3/2.*/

SELECT (5+5)*20-3/2 FROM DUAL;

/* Завдання 4 
4. Складіть запит, якій виведе інформацію про всіх співробітників у форматі: 
Ім’я - Посада (ім’я дефіс посада)*/

select ename ||' '||'-'||' '|| job
as "ename - job"
from emp;

/* Завдання 5 
5. * Складіть запит, якій виведе інформацію о всіх підрозділах у форматі: 
Місто -> Назва
*/
select loc ||' '||'->'||' '|| dname
as "loc -> dname"
from dept;

/* Завдання 6 */
/*6. * Складіть запит, якій виведе інформацію про всі підрозділи у форматі: 
department ‘Назва’ is placed at ‘розташування’ 
Дайте об'єднаним стовпцям заголовок.
*/
select 'Department '''||dname||''' is placed at '||loc||''
as "Department is placed at..."   
from dept; 

-- Виправлене з квотуванням:

select q'[Department ]' ||dname|| q'[ is placed at ]' || loc
as "Department is placed at..." 
from dept;

/* Завдання 7
7. Виведіть імена и заробітну плату співробітників, у яких заробітна плата більше ніж $3000.
*/
select ename, sal 
from emp
where sal > 3000;

/* Завдання 8 
8. * Виведіть імена співробітників, у яких комісія (премія) більше ніж 20 % зарплати.*/
select ename 
from emp
where comm > (sal/100)*20;

/* Завдання 9 
9. Виведіть ім'я співробітника і номер департаменту в якому працює службовець з empno = 7839, 
де 7839 вводиться користувачем.*/
/*
У запиті можна підставляти значення, які введені користувачем за допомогою символу &.
Наприклад, при виконанні запита:
Select * from dept where depno = &my_war_name;
SQL*Plus запросить значення змінної my_war_name і підставить його в запит.
Повторно це значення можна використовувати як &&my_war_name.
*/
select ename, deptno
from emp
where empno = &my_number; -- 7839

/* Завдання 10 */
/*  */
select ename, sal
from emp
where sal < 1500
or    sal > 2500;

/* Завдання 11 */
/*    11. * Виведіть імена всіх MANAGER-ів і ANALYST-ів, 
в яких заробітна плата не дорівнює $2850 та $1500. 
*/
select ename 
from emp
where (job = 'MANAGER' or  job = 'ANALYST')            
and (sal != 2850 and sal != 1500);

-- ПРОВЕРКА          
select ename, job, sal  
from emp
where (job = 'MANAGER' or  job = 'ANALYST')            
and (sal != 2850 and sal != 1500);

/* Завдання 12 
12. Виведіть імена і з/п співробітників для яких з/п знаходиться поза діапазону $ 1500 і $ 2500.*/
select ename, sal
from emp
where sal not between 1500 and 2500;

/* Завдання 13 
13. Виведіть імена та номери департаментів співробітників 10 і 20 департаментів, 
виконайте сортування імен за алфавітом. */
select ename, deptno
from emp
where deptno in (10, 20)
order by ename;

/* Завдання 14 
14. Виведіть з таблиці співробітників ім'я, посаду та дату прийому на роботу 
співробітників SCOTT, ADAMS, ALLEN в порядку їх прийому на роботу.*/
select ename, job, hiredate
from emp
where ename in ('SCOTT', 'ADAMS', 'ALLEN')
order by hiredate;

/* Завдання 15 
15. * Виведіть імена, номери відділів та з/п співробітників для яких з/п знаходиться в
діапазоні $ 1500 і $ 5000  і працюють у відділах з номерами 10 і 20.*/
select ename, deptno, sal
from emp
where sal between 1500 and 5000
and deptno in (10, 20);

/* Завдання 16 
16. Виведіть імена та посади співробітників у яких немає начальників. */
select ename, job
from emp
where mgr is null;

/* Завдання 17 
17. * Виведіть посади співробітників, які не мають начальника або премії, 
за умови, що у виведеному списку посади не повторюються. */

select distinct job
from emp
where mgr is null
or   comm is null;

/* Завдання 18 */
/* 18. *Виведіть імена і премію співробітників, у яких є
премія. */

select ename, comm
from emp
where comm is not null;

-- 2 вариант премии без 0
select ename, comm
from emp
where comm is not null
and comm != 0;

/* Завдання 19 
19. Виведіть імена співробітників, у яких третя літера ‘A’. */
select ename
from emp
where ename like '__A%';

/* Завдання 20 */
/*20. Виведіть імена співробітників, у яких друга літера ‘L’, остання – ‘N’ 
*/
select ename
from emp
where ename like '_L%N';

/* Завдання 21 */
/* 21. * Знайдіть назви міст, в яких використовується символ «_».
*/
select loc
from dept
where loc like '%/_%' escape '/';